#include "gtest.h"
extern "C" {
	# include "xswap.h"
}

//Нужно два отдельных теста под double и float варианты.
//Тесты при inc? != 1

/**
    \file
    \brief
    Тесты для функции xswap
*/
TEST(xswapTest, postive) {
    //Тестируем функцию cblas_dswap
    double a[10] = {1,2,3,4,5,6,7,8,9,10}; // Первый массив
    double b[10] = {10,9,8,7,6,5,4,3,2,1}; // Второй массив
    
    double c[10] = {1,2,3,4,5,6,7,8,9,10}; // Ожидаемый результат в  1 массиве
    double d[10] = {10,9,8,7,6,5,4,3,2,1}; // Ожидаемый результат во 2 массиве
    
    cblas_dswap(10, a, 1, b, 1); //Вызываем функцию cblas_dswap
    
    // Поэелементное сравнение
    for (int i=0; i<10; i++)
    {
        ASSERT_DOUBLE_EQ(d[i], a[i]);
        ASSERT_DOUBLE_EQ(c[i], b[i]);
    }
    
    //Тестируем функцию cblas_sswap
    float af[10] = {1,2,3,4,5,6,7,8,9,10};  // Первый массив
    float bf[10] = {10,9,8,7,6,5,4,3,2,1};  // Второй массив
    
    float cf[10] = {1,2,3,4,5,6,7,8,9,10};  // Ожидаемый результат в  1 массиве
    float df[10] = {10,9,8,7,6,5,4,3,2,1};  // Ожидаемый результат во 2 массиве
    
    cblas_sswap(10, af, 1, bf, 1);  // Вызываем функцию cblas_sswap 
    
    // Поэелементное сравнение 
    for (int i=0; i<10; i++)
    {
        ASSERT_FLOAT_EQ(df[i], af[i]);
        ASSERT_FLOAT_EQ(cf[i], bf[i]);
    }
}
